In [4]:
import pandas as pd
import numpy as np

In [5]:
h=pd.Series([1,2,3,4,5,6,np.nan,8,9,10])
h

0     1.0
1     2.0
2     3.0
3     4.0
4     5.0
5     6.0
6     NaN
7     8.0
8     9.0
9    10.0
dtype: float64

In [9]:
d=pd.date_range("20220710",periods=10)
d

DatetimeIndex(['2022-07-10', '2022-07-11', '2022-07-12', '2022-07-13',
               '2022-07-14', '2022-07-15', '2022-07-16', '2022-07-17',
               '2022-07-18', '2022-07-19'],
              dtype='datetime64[ns]', freq='D')

In [14]:
df=pd.DataFrame(np.random.randn(10,4),index=d,columns=["A","B","C","D"])
df

                   A         B         C         D
2022-07-10 -0.086240  1.540315 -1.543568 -1.651567
2022-07-11  1.570158 -0.100809  1.699249 -0.381755
2022-07-12 -1.749002 -0.383699  3.481185 -0.522400
2022-07-13  0.447234 -1.021315  0.954102  0.937115
2022-07-14  0.287312 -0.675432  1.186768  1.643871
2022-07-15 -1.504698  0.313148  1.766739 -0.559764
2022-07-16  1.531523  2.382437  0.901414 -0.871639
2022-07-17 -1.144551  0.916391  0.769646 -1.122408
2022-07-18  0.691156 -1.073313  0.234940  0.270976
2022-07-19  1.508223  0.732146  0.442070 -1.168332

In [18]:
d1=pd.DataFrame({
    "A":[1,2,3,4],
    "B":pd.Timestamp("20010318"),
    "C":pd.Series(1,index=list(range(4)),dtype="float32"),
    "D":np.array([5]*4,dtype="int32"),
    "E":pd.Categorical(["true","false","True","False"]),
    "F":"Pandas"
})
d1

   A          B    C  D      E       F
0  1 2001-03-18  1.0  5   true  Pandas
1  2 2001-03-18  1.0  5  false  Pandas
2  3 2001-03-18  1.0  5   True  Pandas
3  4 2001-03-18  1.0  5  False  Pandas

In [22]:
d1.dtypes

A             int64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

In [25]:
df.dtypes

A    float64
B    float64
C    float64
D    float64
dtype: object

In [26]:
df.head()

                   A         B         C         D
2022-07-10 -0.086240  1.540315 -1.543568 -1.651567
2022-07-11  1.570158 -0.100809  1.699249 -0.381755
2022-07-12 -1.749002 -0.383699  3.481185 -0.522400
2022-07-13  0.447234 -1.021315  0.954102  0.937115
2022-07-14  0.287312 -0.675432  1.186768  1.643871

In [27]:
df.tail()

                   A         B         C         D
2022-07-15 -1.504698  0.313148  1.766739 -0.559764
2022-07-16  1.531523  2.382437  0.901414 -0.871639
2022-07-17 -1.144551  0.916391  0.769646 -1.122408
2022-07-18  0.691156 -1.073313  0.234940  0.270976
2022-07-19  1.508223  0.732146  0.442070 -1.168332

In [29]:
df.index

DatetimeIndex(['2022-07-10', '2022-07-11', '2022-07-12', '2022-07-13',
               '2022-07-14', '2022-07-15', '2022-07-16', '2022-07-17',
               '2022-07-18', '2022-07-19'],
              dtype='datetime64[ns]', freq='D')

In [30]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [32]:
df.to_numpy()

array([[-0.08623993,  1.54031548, -1.54356801, -1.6515674 ],
       [ 1.5701583 , -0.10080885,  1.69924896, -0.38175498],
       [-1.74900188, -0.38369905,  3.48118466, -0.52239996],
       [ 0.44723429, -1.02131537,  0.95410236,  0.93711463],
       [ 0.2873116 , -0.67543223,  1.18676809,  1.64387051],
       [-1.50469799,  0.31314833,  1.76673859, -0.55976375],
       [ 1.53152272,  2.38243732,  0.90141441, -0.8716394 ],
       [-1.14455058,  0.91639056,  0.76964572, -1.12240838],
       [ 0.69115622, -1.07331303,  0.23494049,  0.27097633],
       [ 1.50822252,  0.73214572,  0.44207044, -1.16833175]])

In [33]:
df.describe()

               A          B          C          D
count  10.000000  10.000000  10.000000  10.000000
mean    0.155112   0.262987   0.989255  -0.342590
std     1.258126   1.137224   1.277935   1.017865
min    -1.749002  -1.073313  -1.543568  -1.651567
25%    -0.879973  -0.602499   0.523964  -1.059716
50%     0.367273   0.106170   0.927758  -0.541082
75%     1.303956   0.870329   1.571129   0.107794
max     1.570158   2.382437   3.481185   1.643871

In [34]:
df.info()

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 10 entries, 2022-07-10 to 2022-07-19
Freq: D
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       10 non-null     float64
 1   B       10 non-null     float64
 2   C       10 non-null     float64
 3   D       10 non-null     float64
dtypes: float64(4)
memory usage: 400.0 bytes

In [35]:
df["C"]

2022-07-10   -1.543568
2022-07-11    1.699249
2022-07-12    3.481185
2022-07-13    0.954102
2022-07-14    1.186768
2022-07-15    1.766739
2022-07-16    0.901414
2022-07-17    0.769646
2022-07-18    0.234940
2022-07-19    0.442070
Freq: D, Name: C, dtype: float64

In [36]:
df[0:3]

                   A         B         C         D
2022-07-10 -0.086240  1.540315 -1.543568 -1.651567
2022-07-11  1.570158 -0.100809  1.699249 -0.381755
2022-07-12 -1.749002 -0.383699  3.481185 -0.522400

In [37]:

df.loc[d[0]]

A   -0.086240
B    1.540315
C   -1.543568
D   -1.651567
Name: 2022-07-10 00:00:00, dtype: float64

In [38]:
df.loc[:,["A","C"]]

                   A         C
2022-07-10 -0.086240 -1.543568
2022-07-11  1.570158  1.699249
2022-07-12 -1.749002  3.481185
2022-07-13  0.447234  0.954102
2022-07-14  0.287312  1.186768
2022-07-15 -1.504698  1.766739
2022-07-16  1.531523  0.901414
2022-07-17 -1.144551  0.769646
2022-07-18  0.691156  0.234940
2022-07-19  1.508223  0.442070

In [39]:
df.loc["20220710":"20220715",["D","C"]]

                   D         C
2022-07-10 -1.651567 -1.543568
2022-07-11 -0.381755  1.699249
2022-07-12 -0.522400  3.481185
2022-07-13  0.937115  0.954102
2022-07-14  1.643871  1.186768
2022-07-15 -0.559764  1.766739

In [41]:
df.loc["20220710",["D","C"]]

D   -1.651567
C   -1.543568
Name: 2022-07-10 00:00:00, dtype: float64

In [44]:
df.loc[d[0],["D","C"]]

D   -1.651567
C   -1.543568
Name: 2022-07-10 00:00:00, dtype: float64

In [46]:
df.at[d[0],"C"]

-1.5435680122894369

In [47]:
df.iloc[3]

A    0.447234
B   -1.021315
C    0.954102
D    0.937115
Name: 2022-07-13 00:00:00, dtype: float64

In [48]:
df.iloc[3:5]

                   A         B         C         D
2022-07-13  0.447234 -1.021315  0.954102  0.937115
2022-07-14  0.287312 -0.675432  1.186768  1.643871

In [53]:
df2=df.reindex(index=d[0:4],columns=list(df.columns)+["E"])
df2.loc[d[0]:d[1],"E"]=2
df2

                   A         B         C         D    E
2022-07-10 -0.086240  1.540315 -1.543568 -1.651567  2.0
2022-07-11  1.570158 -0.100809  1.699249 -0.381755  2.0
2022-07-12 -1.749002 -0.383699  3.481185 -0.522400  NaN
2022-07-13  0.447234 -1.021315  0.954102  0.937115  NaN

In [54]:
df2.isnull()

                A      B      C      D      E
2022-07-10  False  False  False  False  False
2022-07-11  False  False  False  False  False
2022-07-12  False  False  False  False   True
2022-07-13  False  False  False  False   True

In [57]:
df2.dropna()

                   A         B         C         D    E
2022-07-10 -0.086240  1.540315 -1.543568 -1.651567  2.0
2022-07-11  1.570158 -0.100809  1.699249 -0.381755  2.0

In [58]:
df2.fillna(value=2222)

                   A         B         C         D       E
2022-07-10 -0.086240  1.540315 -1.543568 -1.651567     2.0
2022-07-11  1.570158 -0.100809  1.699249 -0.381755     2.0
2022-07-12 -1.749002 -0.383699  3.481185 -0.522400  2222.0
2022-07-13  0.447234 -1.021315  0.954102  0.937115  2222.0

In [59]:
df2.mean()

A    0.045538
B    0.008623
C    1.147742
D   -0.404652
E    2.000000
dtype: float64

In [60]:
f=pd.Series(["aman","abhijith","dj",np.nan])
f.str.upper()

0        AMAN
1    ABHIJITH
2          DJ
3         NaN
dtype: object

In [62]:
g=pd.DataFrame(np.random.randn(10,4))
g

          0         1         2         3
0 -1.957817  0.491290 -0.484380  0.578645
1 -1.632989 -1.826068  0.776619 -0.020725
2 -1.952333 -0.697097  0.741706  0.880802
3 -1.202934  0.749704 -0.763031  0.445601
4  0.867825 -0.454760 -0.409652 -0.039166
5 -1.221031  0.681947 -0.354586 -0.133663
6 -1.718692  0.167755  2.255629  0.339302
7 -0.870600  0.278605 -0.596431  0.224010
8 -0.738334 -0.406262 -0.168967  1.243716
9 -0.397196 -1.651838 -0.651918  0.987903

In [63]:
q=[g[:3],g[3:7],g[7:]]
q

[          0         1         2         3
 0 -1.957817  0.491290 -0.484380  0.578645
 1 -1.632989 -1.826068  0.776619 -0.020725
 2 -1.952333 -0.697097  0.741706  0.880802,
           0         1         2         3
 3 -1.202934  0.749704 -0.763031  0.445601
 4  0.867825 -0.454760 -0.409652 -0.039166
 5 -1.221031  0.681947 -0.354586 -0.133663
 6 -1.718692  0.167755  2.255629  0.339302,
           0         1         2         3
 7 -0.870600  0.278605 -0.596431  0.224010
 8 -0.738334 -0.406262 -0.168967  1.243716
 9 -0.397196 -1.651838 -0.651918  0.987903]

In [64]:
pd.concat(q)

          0         1         2         3
0 -1.957817  0.491290 -0.484380  0.578645
1 -1.632989 -1.826068  0.776619 -0.020725
2 -1.952333 -0.697097  0.741706  0.880802
3 -1.202934  0.749704 -0.763031  0.445601
4  0.867825 -0.454760 -0.409652 -0.039166
5 -1.221031  0.681947 -0.354586 -0.133663
6 -1.718692  0.167755  2.255629  0.339302
7 -0.870600  0.278605 -0.596431  0.224010
8 -0.738334 -0.406262 -0.168967  1.243716
9 -0.397196 -1.651838 -0.651918  0.987903